In [1]:
import pandas as pd

In [2]:
eg_series = ['Zebra','Lion','Tigor']

In [4]:
s = pd.Series(eg_series)

In [6]:
s.iloc[2]

'Tigor'

In [7]:
s.loc[0]

'Zebra'

In [8]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [11]:
s.iloc[0]

'Bhutan'

In [12]:
s = pd.Series([100.00, 120.00, 101.00, 3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [14]:
total = 0
for item in s:
    total+=item
print(total)

324.0

In [15]:
import numpy as np

total = np.sum(s)
print(total)

324.0

In [16]:
s = pd.Series(np.random.randint(0,1000,10000))
s.head()

0    109
1    327
2    283
3    484
4    286
dtype: int64

In [18]:
%%timeit -n 100
total = 0
for item in s:
    total+=item
# print(total)

1.87 ms ± 124 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [20]:
%%timeit -n 100
total = np.sum(s)
# print(total)

122 µs ± 48.6 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [3]:
car_1 = pd.Series({"Make":"BMW","Colour":"Red","Year":"2000"})
car_2 = pd.Series({"Make":"Lamborghini","Colour":"Black","Year":"2015"})
car_3 = pd.Series({"Make":"Lotus","Colour":"Yellow","Year":"2009"})

In [8]:
car_details = pd.DataFrame(data=[car_1,car_2,car_3],index=["Man_1","Man_2","Man_3"])

In [9]:
car_details

              Make  Colour  Year
Man_1          BMW     Red  2000
Man_2  Lamborghini   Black  2015
Man_3        Lotus  Yellow  2009

In [10]:
car_details.loc["Man_1"]

Make       BMW
Colour     Red
Year      2000
Name: Man_1, dtype: object

In [11]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [17]:
new = df.T
df.loc[:,["Name","Cost"]]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0

In [20]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])


df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [26]:
df["Cost"] = df["Cost"].apply(lambda x:0.8*x).astype(float)
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  14.4
Store 1  Kevyn   Kitty Litter   1.6
Store 2  Vinod      Bird Seed   3.2

In [27]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])


# Your answer here

In [28]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [34]:
df.set_index(["Name"])

      Item Purchased  Cost
Name
Chris       Dog Food  22.5
Kevyn   Kitty Litter   2.5
Vinod      Bird Seed   5.0